w11d3/bench_bnb/app/models/user.rb

  def self.find_by_credentials(username, password)
    @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "username123"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "DthnI01P-wey9Vbjx4yYhQ"], ["updated_at", "2020-10-07 23:28:44.520373"], ["id", 1]]