w11d3/bench_bnb/app/controllers/api/benches_controller.rb

  def index
    @benches = Bench.all
---
SELECT "benches".* FROM "benches"

  def show
    @bench = Bench.find(params[:id])
---
SELECT  "benches".* FROM "benches" WHERE "benches"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @bench = Bench.new(bench_params)
    if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Random but cool bench"], ["lat", 37.778425], ["lng", -122.429441], ["created_at", "2020-10-08 21:13:20.238207"], ["updated_at", "2020-10-08 21:13:20.238207"]]