w11d3/bench_bnb/app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @user = User.find(params[:id])

INSERT INTO "users" ("username", "email", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save